org/episodes.org
#+HUGO_SECTION: episode
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
# ensure only a single author is listed, not an array otherwise breaks castinet theme?
# https://github.com/kaushalmodi/ox-hugo/issues/180
#+AUTHOR:
#+HUGO_CUSTOM_FRONT_MATTER: :author "Alex Murray" :explicit no :episode_image img/episode/default.png

* Episode 13
:PROPERTIES:
:EXPORT_FILE_NAME: episode-13
:EXPORT_DATE: 2018-11-26
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :episode_image img/episode/default.png :explicit no :podcast_file USP_E013.mp3 :podcast_duration "08:30" :podcast_bytes "8162872"
:END:
#+begin_description
This week we look at some details of the 16 unique CVEs addressed across the supported Ubuntu releases and more.
#+end_description
** Overview
This week we look at some details of the 16 unique CVEs addressed across the supported Ubuntu releases and more.
** This week in Ubuntu Security Updates
16 unique CVEs addressed
*** [[[https://usn.ubuntu.com/3816-2/][USN-3816-2]]] systemd vulnerability
- 3 CVEs addressed in Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-15687][CVE-2018-15687]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-15686][CVE-2018-15686]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-6954][CVE-2018-6954]]
- Episode 12 - original fix for CVE-2018-6954 was incomplete - this includes the complete fix
- Also includes an update to avoid a possible hang on shutdown in unattended-upgrades - [[https://bugs.launchpad.net/bugs/1803391][LP #1803391]]
  - During shutdown, systemd is already in the process of shutting down
  - Then unattended-upgrades runs and it goes and tries to update systemd - which then tries to reexec it - which blocks waiting for it to finish shutting down
  - Creates a deadlock since systemd is waiting on unattended-upgrades to finish but u-u is waiting on systemd reexec
  - Fix is to not do reexec if systemd is already in the process of stopping

*** [[[https://usn.ubuntu.com/3825-1/][USN-3825-1]], USN-3825-2] mod_perl vulnerability
- 1 CVEs addressed in Precise ESM, Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2011-2767][CVE-2011-2767]]
- Old CVE - reported to Debian in 2011, who assigned a CVE internally but didn't go any further with it
- Recently the original reporter of the vulnerability submitted a patch to Debian to fix it - so vuln was reported to Mitre
- Now fixed in Ubuntu as well

*** [[[https://usn.ubuntu.com/3801-2/][USN-3801-2]]] Firefox regressions
- 12 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12397][CVE-2018-12397]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12396][CVE-2018-12396]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12395][CVE-2018-12395]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12403][CVE-2018-12403]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12402][CVE-2018-12402]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12401][CVE-2018-12401]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12399][CVE-2018-12399]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12398][CVE-2018-12398]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12393][CVE-2018-12393]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12392][CVE-2018-12392]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12390][CVE-2018-12390]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12388][CVE-2018-12388]]
- Firefox update (v63) (Episode 9) had some minor regressions
  - These were present in the upstream firefox release itself
- This provides [[https://www.mozilla.org/en-US/firefox/63.0.3/releasenotes/][63.0.3]] which contains these fixes from upstream to address the regressions
  - WebGL hangs, slow page loading if using specific proxy settings etc.

** Goings on in Ubuntu Security Community
*** Linux Cryptocoin Malware
- https://www.zdnet.com/article/new-linux-crypto-miner-steals-your-root-password-and-disables-your-antivirus/
- Apparently reports of users affected
- Requires SSH to login - bruteforce passwords
  - Use strong passwords / public key auth
- Elevates privileges via two very old CVEs
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2016-5195][CVE-2016-5195]] - Dirty Cow - fixed for Ubuntu in October 2016
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2013-2094][CVE-2013-2094]] - perf root privilege escalation - fixed for Ubuntu in May 2013
- All Ubuntu users are fine unless you are running a old release AND have not been applying security patches
- Please use strong passwords if enabling openssh server

*** Preview of next episode
**** Upcoming fixes
- qemu, webkitgtk
** Get in contact
- [[mailto:security@ubuntu.com][security@ubuntu.com]]
- [[http://webchat.freenode.net?channels=%2523ubuntu-hardened&uio=d4][#ubuntu-hardended on the Freenode IRC network]]
- [[https://twitter.com/ubuntu_sec][@ubuntu_sec on twitter]]

